[
  {
    "id": 1,
    "title": "Getting Started With Splunk Observability",
    "description": "Observability has three pillars (Traces, Metrics, Logs), many moving parts and can be overwhelming to get started. We will walk you through the Splunk Observability Application Performance Monitoring (APM) initial steps, starting from downloading a sample application from git all the way to seeing the telemetry reported on the Splunk Observability Cloud platform.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "Log",
    "product2": "log",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "baseline",
    "phase2": "",
    "phase3": "",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 2,
    "title": "Extending Monitoring With Observability",
    "description": "In today's world of cloud-native applications with microservices, ephemeral execution and elastic behavior, we need observability. We already monitor our systems, and observability starts with monitoring. However, observability also goes beyond simple monitoring to give you greater operational insight, leading to shorter incidents, fewer quality problems, a better product and happier customers. So, how do we get from monitoring to observability? What are the differences and extensions we need to consider? How can observability move us to an active response state? In this talk, we will investigate the five characteristics that you need in moving from the known status of your environment to discovering and responding to the unknowns to which we respond. We'll cover what observability is and why it is increasingly important, the telemetry needs of observability and how monitoring extends into this space, and how observability expands your AI/ML to produce better and faster results.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 101,
    "phase1": "baseline",
    "phase2": "",
    "phase3": "",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1261C"
  },
  {
    "id": 3,
    "title": "Observability From The Ground Up: Using OpenTelemetry and Splunk APM at Care.com",
    "description": "In early 2020, Care.com embarked on a platform modernization effort to move from monolithic applications to microservices. It was decided from the beginning that observability would be a first-class principle in the new architecture. With the announcement of OpenTracing and OpenCensus merging into a new standard named OpenTelemetry, and an invitation to become an early adopter of Splunk APM, this became an opportunity to build observability into the new platform architecture. Learn how Care.com built custom instrumentation libraries for our gRPC and Lambda services using opentelemetry-go and the importance of context propagation to enable end-to-end tracing between services running in Kubernetes and managed services like Lambdas.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "apm",
    "product2": "log",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 4,
    "title": "I Have Splunk Cloud Platform. What Can I Do to Add Observability?",
    "description": "As a Splunk Cloud Platform user or admin, you're using Splunk to monitor aspects of your infrastructure and custom applications, and perform investigations when things don't quite work. But the more cloud-native infrastructure and applications you're using, the more complex collecting, indexing and analyzing that data has become. In this fast-paced session, we'll outline three key ways to augment how you're using Splunk Cloud Platform to collect cloud-native data more easily, accelerate and simplify alerting, and add context to data so triage and troubleshooting are easier and faster. We'll focus on ways to augment infrastructure monitoring, use synthetic monitoring to gain better top-level monitoring data that reflects user experience, and look to observability principles to take a service-oriented view into your systems while instrumenting applications to supply insight into their availability, usage and performance.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 201,
    "phase1": "baseline",
    "phase2": "",
    "phase3": "",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 5,
    "title": "The Challenges and Solutions for Modern Infrastructure Monitoring and Troubleshooting",
    "description": "As cloud-native infrastructure rapidly proliferates, ITOps, DevOps and SRE teams face a sprawling complexity in their environment. It makes easier, faster, more reliable and scalable infrastructure monitoring and troubleshooting even more critical and hard. To get visibility across your environments, to see how problems in one part of your stack affect another, customers had to use different tools or jump from one screen to another, with critical time wasted. The skyrocketed volume of objects makes efficient monitoring and accurate alerting even harder. Speed and scale are the greatest assets in monitoring and maintaining your modern infrastructure. Attend this session to learn how we address these challenges for our customers with Splunk Infrastructure Monitoring.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 6,
    "title": "Observability as Code at Diligent",
    "description": "DevOps and IT teams use infrastructure as code to build, manage and automate infrastructure resources. In this session, learn how Diligent automates observability workflows - from provisioning to production. We'll discuss how we manage the lifecycle of Splunk Infrastructure Monitoring agents and provide observability as a service to internal teams leveraging HashiCorp Terraform to automatically generate observability assets such as url monitors, dashboards, detectors and alerts. Attend this session to learn how to reduce toil and consistently implement observability practices across different teams.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "baseline",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 7,
    "title": "Kubernetes Observability for Beginners: How Splunk Helps You on Your Journey",
    "description": "Since our first virtual .conf, many organizations have accelerated their technology transitions that were already underway, including the journey to the cloud, containers and microservices. Kubernetes is an important part of that journey, and it's still a big lift. In this session, we'll talk about how to observe your Kubernetes infrastructure, how to overcome some of the key challenges of monitoring a rapidly changing environment, and how Splunk Observability Cloud will get you there.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "baseline",
    "phase2": "",
    "phase3": "",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 8,
    "title": "Introduction to Splunk Synthetic Monitoring for Availability, Functionality and Performance of Your Websites and APIs",
    "description": "Fast, available Sites have never been more important. For DevOps engineers, developers and web admins, the promise of synthetic monitoring is to proactively detect and resolve issues while delivering a great user experience. With Splunk's acquisition of Rigor, Splunk now has best in class synthetic monitoring for quick troubleshooting and deep web performance optimization to improve end-user experience. Join AK Khamis and Georgios Glymidakis, Splunk professional services architects, as they showcase easy ways to proactively monitor basic uptime, API performance and customer experience across full page loads and user journeys.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "synth",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 9,
    "title": "Splunk Real User Monitoring – Every Second Counts",
    "description": "It's very clear, customers abandon poorly performing applications. However, as engineering teams use DevOps and microservices to deploy faster, they also face blind spots and wider surface areas when troubleshooting customer-facing issues. Regardless of title, DevOps engineers, site reliability engineers, and front-end developers alike need visibility of how an entire distributed system impacts their end-user experience. Join Shashwat Sehgal, Splunk senior group product manager, as he demonstrates how Splunk's open source built, OpenTelemetry standardized Real User Monitoring (RUM) solution provides end-to-end context from web browsers through backend services. You'll understand how to measure the end-to-end impact of system performance on end-user experience, how to easily prioritize your most severe customer-facing issues, and how Splunk RUM's open source, OpenTelementry standardized instrumentation adds value as you modernize your applications.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "rum",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 10,
    "title": "Getting Started With the OpenTelemetry Collector",
    "description": "The OpenTelemetry Collector is an open-source and vendor-agnostic way to receive, process and export telemetry data, including metrics, traces and logs. It offers support for open-source projects including Jaeger, Zipkin and Prometheus and is the unified agent for Splunk Observability Cloud. This session will cover the deployment architecture, configuration and production-readiness considerations for the collector. You will see how easy it is to get started and how powerful and extensible the collector is. A demo of collecting and modifying telemetry data will be provided.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "log",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "baseline",
    "phase2": "",
    "phase3": "",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 11,
    "title": "Debating Logs vs. Traces: Lessons Learned Adopting Distributed Tracing At Shopify",
    "description": "In the five years since Shopify began rolling out distributed tracing to production environments, they've encountered many misunderstandings about its value, how it works and when to use it. Software engineers are comfortable with metrics and traditional APM suites yet often rely on logs as the source of truth and default signal for debugging applications. Shopify engineering is known for shipping new features at extreme scale, and that has left little time for developers to explore new tools that may help them answer questions and resolve problems faster as Shopify's architecture evolves from a monolith to an increasingly large constellation of services. Join Shopify's Francis Bogsanyi, production engineering lead and Splunk's Joshua Grose, senior product manager, as they debate logging vs. tracing and dive into common misconceptions, past mistakes, and how Shopify is working on teaching developers when and how to use tracing, and why.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "apm",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 12,
    "title": "Deep Dive Into How Splunk Observability Can Help You Reduce Infrastructure Downtime",
    "description": "Now more than ever, the time - in seconds - something is down directly correlates to revenue lost. Learn how Splunk Observability can help reduce downtime with reduced mean time to clue (what is the root cause of the outage) and MTTR (mean time to resolution). Help your DevOps teams spend less time responding to alerts and being part of incident response teams working to resolve outages. With less time spent on incidents, DevOps can further reduce the number and duration of outages by adding auto-remediation and other enhancements or working on new projects.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "oncall",
    "product2": "im",
    "product3": "apm",
    "product4": "log",
    "product5": "",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 13,
    "title": "Establishing System Reliability With SLIs, SLO and Error Budgets at Raymond James",
    "description": "The practice of Site Reliability Engineering is no longer a new idea and SREs can be found in many major companies all over the world. Raymond James Financial has recently started to embrace the practice of Site Reliability Engineering. With the help of Splunk, they have established a successful practice of SLIs, SLOs and error budgets. Their Site Reliability team uses Splunk every day to turn our log data into meaningful observability that our support, development, and architecture teams use to drive our company's innovation and manage our system reliability.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 14,
    "title": "OpenTelemetry at Splunk and Google",
    "description": "OpenTelemetry has established itself as the best and most popular way to capture signals from your applications and infrastructure so that they can be sent to backends like Splunk Observability Cloud and Google Cloud Ops for processing. This session will show real-world production examples of OpenTelemetry being used within Splunk and Google and amongst major customers. From this, you can see how to best deploy and manage OpenTelemetry at your organization and how you can gain deeper insights into the performance and status of your applications using tools from Splunk and Google.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 15,
    "title": "How Observability Enables Distributed Incident Management",
    "description": "As applications become increasingly complex, holding the entire architecture of a site in your head becomes more and more difficult. To help mitigate this, Splunk's Observability team has adopted a distributed incident response approach. In this approach, there's no single point of contact (e.g., a NOC) for alerting, response and follow up. Instead, when an incident occurs, Splunk Incident Response routes the incident to a product owner responsible for handling it. They are accountable for their particular part of the stack, reducing alerts going to the wrong person and speeding MTTRs. This session will share how Splunk Observability Cloud lets us monitor, triage and resolve incidents without a centralized response team.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 16,
    "title": "Observing the Observers: How Splunk Cloud Platform Uses Splunk Observability",
    "description": "Cloud systems can fail in a myriad of unpredictable and incomprehensible ways. We are the team chartered with providing tools, patterns, and infrastructure that support the reliable operations of Splunk Cloud Platform. Splunk runs an exceptionally large infrastructure. Our enterprise fleet has tens of thousands of Splunk instances and our Kubernetes infrastructure emits millions of data points per second across thousands of nodes. In this session, our observability leaders will explain how we use our very own Splunk Observability Cloud to achieve real-time monitoring, accurate alerting and fast troubleshooting. And there is more! We will share learnings and best practices that you can take back to your organization and implement.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "oncall",
    "product2": "im",
    "product3": "apm",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 17,
    "title": "OTel Me Why",
    "description": "OpenTelemetry is an open-source and vendor-agnostic solution to instrument and collect telemetry data, including metrics, traces and logs. Splunk Observability Cloud supports the OpenTelemetry standard, and Splunk customers love it! In this panel discussion, hear direct from Splunk customers on how OpenTelemetry has helped them better observe their systems while avoiding vendor lock-in.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "im",
    "product2": "apm",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 18,
    "title": "Progressive's Journey to Observability; From Hand-Rolled To Shrink-Wrapped",
    "description": "Observability has been a buzzword for over a year, but what would you have done before that?? At Progressive, we had logs and metrics in Splunk but saw the need for full fidelity tracing before OpenTelemetry was a thing. Join this session to learn how you can get tracing in everything from old school monolithic applications deployed to on-prem physical servers, all the way to auto-instrumenting your microservices to run in a containerized environment. By mixing hand-rolled solutions to support the old stuff along with modern shrink-wrapped solutions for the new stuff, Progressive is able to capture the full spectrum of applications.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "apm",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 19,
    "title": "Splunk Log Observer - Log Investigations Designed for Observability",
    "description": "Log investigations across use cases and departments are not the same, which is particularly true in DevOps teams. Developers need to rapidly find the logs that will help them debug problems and SREs and platform teams want to get real-time insights into how application and infrastructure changes affect performance. Meet Splunk Log Observer. Part of the Splunk Observability Cloud, Splunk Log Observer, offers a new experience that tightly connects logs with related metrics and traces while providing new ways to quickly explore logs and find incoming problems in real time. In this session, we'll walk through how Splunk Log Observer works, show you Splunk Log Observer in action and what you can do to get started.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "apm",
    "product2": "log",
    "product3": "rum",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 20,
    "title": "Splunk Real User Monitoring - Every Second Counts",
    "description": "It's very clear, customers abandon poorly performing applications. However, as engineering teams use DevOps and microservices to deploy faster, they also face blind spots and wider surface areas when troubleshooting customer-facing issues. Regardless of title, DevOps engineers, site reliability engineers, and front-end developers alike need visibility of how an entire distributed system impacts their end-user experience. Join Shashwat Sehgal, Splunk senior group product manager, as he demonstrates how Splunk's open source built, OpenTelemetry standardized Real User Monitoring (RUM) solution provides end-to-end context from web browsers through backend services. You'll understand how to measure the end-to-end impact of system performance on end-user experience, how to easily prioritize your most severe customer-facing issues, and how Splunk RUM's open source, OpenTelementry standardized instrumentation adds value as you modernize your applications.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "rum",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 21,
    "title": "Splunk RUM for Mobile: Mobile App Observability with Splunk Real User Monitoring",
    "description": "2020 was a year of 20% growth for the mobile app economy - for both daily hours spent per user (4.2 hours), and App/Play Store spend ($143B); the latter having a potential to double by 2024! As your team continues or increases their investment in your brand’s mobile app, having depth of visibility into the inner workings of your mobile applications and how users experience it is imperative. Whether it’s slow API responses, third party library dependencies, or the wild-west of Android devices, you can get to the root cause of end-user issues quickly with Splunk Real User Monitoring (RUM) for Mobile Apps. We’ll demonstrate how easy it is to get started with open-sourced and OpenTelemetry compliant libraries for iOS and Android, showcase how to monitor your app health and troubleshoot user-experience issues to reduce your MTTD.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "rum",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 22,
    "title": "Synthetic Monitoring and Single Page Apps: How To Increase Control, Visibility and Performance",
    "description": "For web developers or SREs leveraging Single Page Applications, client-side rendering can create challenges of control, visibility and understanding user experience. Modern synthetic monitoring promises deeper understanding and visibility into the user experience in pre-production and after deployment. Join Developer and Technology Advocates Tetiana Kelly and Scott Mason as they discuss how they leveraged synthetic monitoring to identify performance improvement opportunities for Splunk's global SPA, The Quest for Observability. From measuring user experiences across geographies to compression and image optimization opportunities, this talk provides best practices and lessons learned to help engineers deploy better SPAs.",
    "duration": 30,
    "cost": 0,
    "type": "conf",
    "product1": "synth",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://conf.splunk.com/watch/conf-online.html?search=DVO1111C"
  },
  {
    "id": 23,
    "title": "Introduction to Splunk Observability",
    "description": "This module distinguishes between monitoring and observability and the requirements for an observable system. Learn about the components in Splunk Observability Cloud.",
    "duration": 25,
    "cost": 0,
    "type": "elearning",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 101,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "",
    "persona3": "",
    "link": "https://www.splunk.com/en_us/training/courses/introduction-to-splunk-observability.html"
  },
  {
    "id": 24,
    "title": "Introduction to Splunk IM",
    "description": "This course will give you an overview of the following topics: Getting Data into Infrastructure Monitoring, Data Model, Built-in Content, Dashboards and Dashboard Groups, Charts, and Detectors.",
    "duration": 25,
    "cost": 0,
    "type": "elearning",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "",
    "persona3": "",
    "link": "https://www.splunk.com/en_us/training/courses/introduction-to-splunk-im.html"
  },
  {
    "id": 25,
    "title": "Splunk Infrastructure Monitoring Fundamentals",
    "description": "This course serves as the foundation for all other Splunk Infrastructure Monitoring courses. It is targeted towards DevOps/SRE/Observability teams, Senior On-call Engineers, Onboarding and Monitoring Strategists and Developers. This 4.5-hour course provides a fundamental understanding of Splunk Infrastructure Monitoring concepts such as the Splunk IM data model and different types of metadata. See how you can search for metrics, find more information about a metric, visualize and alert on metrics. Learn to use appropriate rollups, interpret chart data based on chart resolution, rollups and analytic functions. All concepts are taught using lectures and scenario-based, hands-on activities.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/splunk-infrastructure-monitoring-fundamentals"
  },
  {
    "id": 26,
    "title": "Using Splunk Application Performance Monitoring",
    "description": "This 4.5-hour virtual course, targeted to developers and DevOps, enables you to use Splunk APM to analyze traces, troubleshoot and monitor your microservices-based applications. Through in-person discussions and hands-on activities, deep dive into uses of distributed tracing, navigating the Splunk APM app to analyze traces, visualize and alert on APM metrics. All concepts and taught through discussions and hands-on activities.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "apm",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://www.splunk.com/en_us/training/courses/using-splunk-application-performance-monitoring.html"
  },
  {
    "id": 27,
    "title": "Using Splunk Real User Monitoring",
    "description": "This module describes Splunk Real User Monitoring. It describes use cases for Splunk RUM, basic Splunk RUM concepts and terminology. Learn how to instrument your application to send in RUM data. You will also see how to navigate the different components in Splunk RUM and examples of using Splunk RUM to identify and troubleshoot problems in your application.",
    "duration": 30,
    "cost": 0,
    "type": "elearning",
    "product1": "rum",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/elearning/using-splunk-real-user-monitoring"
  },
  {
    "id": 28,
    "title": "Using the Splunk Log Observer",
    "description": "This course describes the following Splunk Observability Cloud Enterprise features",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "log",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 101,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/using-the-splunk-log-observer"
  },
  {
    "id": 29,
    "title": "Using Splunk Synthetic Monitoring",
    "description": "This course is designed for developers responsible for debugging their own applications, and for SREs responsible for troubleshooting performance issues. The Splunk Log Observer is built primarily for DevOps teams working on applications built on modern tech stacks (containerized micro-services). However, the course it can be taken by anyone who wants to view recent log data in a no-code environment. This 1-virtual-day course describes how to use the tool to work with log data using the no-code user interface. You will learn to create, save, and share search filters; and to investigate the shape of your log data. You will analyze logs with aggregation functions and group by rules. And you will create rules to manipulate incoming data, as well as to generate synthetic metrics from log data. All concepts are taught using lectures and scenario-based hands-on activities.",
    "duration": 30,
    "cost": 0,
    "type": "elearning",
    "product1": "synth",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/elearning/using-splunk-synthetic-monitoring"
  },
  {
    "id": 30,
    "title": "Incident Response with Splunk On-Call",
    "description": "This free, 10-minute eLearning video explains basic Splunk On-Call concepts such as shifts, rotations, escalation policies, and on-call schedule. Learn how to create your personal and custom paging policies, locate your on-call schedule in the web UI and mobile app, and describe the actions you can take if you need on call coverage. You will also learn how you can respond to an incident and the different available incident actions.",
    "duration": 10,
    "cost": 0,
    "type": "elearning",
    "product1": "oncall",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://www.splunk.com/en_us/training/courses/incident-response-with-splunk-on-call.html"
  },
  {
    "id": 31,
    "title": "Splunk Observability Cloud: Enterprise Features",
    "description": "This 17-minute eLearning video describes how to set permissions and use mirrored dashboards in Splunk Observability Cloud Enterprise",
    "duration": 17,
    "cost": 0,
    "type": "elearning",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://www.splunk.com/en_us/training/courses/splunk-observability-cloud-enterprise-features.html"
  },
  {
    "id": 32,
    "title": "Responding to Incidents in Splunk On Call",
    "description": "This module explains basic Splunk On-Call concepts such as shifts, rotations, escalation policies, and on-call schedule. Learn how to create your personal and custom paging policies, locate your on-call schedule in the web UI and mobile app, and describe the actions you can take if you need on call coverage. You will also learn how you can respond to an incident and the different available incident actions.",
    "duration": 30,
    "cost": 0,
    "type": "elearning",
    "product1": "oncall",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 201,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/elearning/responding-to-incidents-in-splunk-on-call"
  },
  {
    "id": 33,
    "title": "Splunk Observability Teams",
    "description": "This course describes the benefits of using Splunk Observability Cloud teams. You will see how to set up teams and manage teams in your Splunk Observability Cloud org.",
    "duration": 30,
    "cost": 0,
    "type": "elearning",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/elearning/splunk-observability-teams"
  },
  {
    "id": 34,
    "title": "Splunk On-Call Administration",
    "description": "This course is targeted towards Splunk On-call admins responsible for setting up incident response with Splunk On-Call. This 1-virtual day course describes the tasks required to set up on-call teams, including defining schedules, on-call rotations and shifts. Learn to set-up and configure alerts and integrations. Create post-incident review reports, track response metrics and customize reports. Use advanced features such as the Rules engine for advanced customization and configure webhook integrations. All concepts are taught using lectures and scenario-based hands-on activities.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "oncall",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "",
    "link": "https://education.splunk.com/category/splunk-on-call-administration"
  },
  {
    "id": 35,
    "title": "Kubernetes Monitoring Using Splunk IM",
    "description": "This 1-virtual day course is targeted to Site Reliability Engineers, DevOps Engineers, and Application Developers who deploy on and/or who manage Kubernetes clusters. This course teaches the skills you need to monitor and troubleshoot your Kubernetes infrastructure with Splunk. We teach how to track and alert on the status of your installation using built-in tools focused on Kubernetes. You will learn to introspect clusters from multiple perspectives and identify potential trouble-indicators. Through in-person discussions and hands-on activities learn multiple ways you can view and automate the monitoring of your clusters and running jobs.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/kubernetes-monitoring-with-splunk"
  },
  {
    "id": 36,
    "title": "Automation Using the REST and SignalFlow APIs",
    "description": "Splunk IM exposes a comprehensive API that allows you to automate any action that can be done using the User Interface. This 2-day virtual course provides the foundation for you to use the API to automate bulk actions such as the creation of charts, dashboards, and alerts. See how to programmatically perform computations that can be used in charts and detectors or streamed in real-time. Use the API to manage Splunk IMteams Learn the concepts and apply the knowledge through discussions and hands-on activities.",
    "duration": 480,
    "cost": 1000,
    "type": "instructor",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/automation-using-the-signalfx-api"
  },
  {
    "id": 37,
    "title": "Using the Splunk IM Terraform Provider",
    "description": "This virtual 2-day course targeted towards DevOps, Observability and SRE teams is a follow-up to the course \"Automation Using the REST and SignalFlow APIs\". Learn to use the Splunk Terraform provider to manage Splunk IM resources for visualization, alerting and teams. Create and manage detectors and muting rules. Learn to create and modify teams including team notification policies.",
    "duration": 480,
    "cost": 1000,
    "type": "instructor",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "",
    "phase4": "",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/using-the-splunk-terraform-provider"
  },
  {
    "id": 38,
    "title": "Ingesting Application Metrics in Splunk IM",
    "description": "This 1-day virtual course, targeted towards developers and DevOps, focuses on creating custom metrics to monitor your applications/services with Splunk IM. Learn to instrument applications/services to send in custom metrics that characterize the application of service. Define relevant metadata for your metrics to let you find, filter and aggregate the metrics that you want to chart or alert on. Create charts and custom dashboards to visualize these custom metrics. Create detectors to monitor the metrics to alert when there are any issues with the application or service.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "",
    "phase4": "",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/ingesting-application-metrics-in-splunk-im"
  },
  {
    "id": 39,
    "title": "Using Splunk Application Performance Monitoring",
    "description": "This 1-virtual day course targeted to developers and DevOps enables you to use Splunk APM to analyze traces, troubleshoot and monitor your microservices-based applications. Through in-person discussions and hands-on activities, deep dive into uses of distributed tracing, navigating the Splunk APM app to analyze traces, visualize and alert on APM metrics.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "apm",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/using-signalfx-to-monitor-microserves-based-applications"
  },
  {
    "id": 40,
    "title": "Visualizing and Alerting in Splunk Infrastructure Monitoring",
    "description": "This course assumes that you have completed the course Splunk Infrastructure Monitoring Fundamentals. It is targeted towards DevOps/SRE/Observability teams, Senior On-call Engineers, Onboarding and Monitoring Strategists and Developers. This 1-virtual day course describes ways to enhance your dashboards and alerts to help with troubleshooting. Find insights using analytics in charts and detectors. Create detectors for common use cases. All concepts are taught using lectures and scenario-based hands-on activities.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/visualizing-and-alerting-in-splunk-infrastructure-monitoring"
  },
  {
    "id": 41,
    "title": "Instrumenting Applications for Splunk APM",
    "description": "This 1-day virtual course targeted to developers and DevOps enables you to instrument your applications to send traces to Splunk APM. Through in-person discussions and hands-on activities, learn to deploy the Splunk OpenTelemtry Connector on a Linux host. Use auto-instrumentation to send in traces without altering your code. Use manual instrumentation to create spans and add metadata to spans. This course assumes familiarity with navigating Splunk APM which is covered in the course Using Splunk Application Performance Monitoring. This lab-orientated class is designed to help you learn the fundamentals of instrumenting your code to send in traces. All hands-on labs are in Python and Java.",
    "duration": 240,
    "cost": 500,
    "type": "instructor",
    "product1": "apm",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "",
    "persona3": "devops",
    "link": "https://education.splunk.com/category/advanced-monitoring-of-microservices-applications-using-signalfx"
  },
  {
    "id": 42,
    "title": "Technical Badge - PS Infrastructure Monitoring - Foundational",
    "description": "",
    "duration": null,
    "cost": null,
    "type": "accreditation",
    "product1": "im",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://splunkpartnerlearningcenter.mindtickle.com/#/programs/program/1431355991266716495"
  },
  {
    "id": 43,
    "title": "Technical Badge - PS DevOps - Foundational",
    "description": "",
    "duration": null,
    "cost": null,
    "type": "accreditation",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 301,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "",
    "persona3": "devops",
    "link": "https://splunkpartnerlearningcenter.mindtickle.com/#/programs/program/1442577956436158640"
  },
  {
    "id": 44,
    "title": "Technical Badge - PS Log Observer - Foundational",
    "description": "",
    "duration": null,
    "cost": null,
    "type": "accreditation",
    "product1": "log",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://splunkpartnerlearningcenter.mindtickle.com/#/programs/program/1431358142393854459"
  },
  {
    "id": 45,
    "title": "Technical Badge - PS Observability Cloud - Foundational",
    "description": "",
    "duration": null,
    "cost": null,
    "type": "accreditation",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 201,
    "phase1": "baseline",
    "phase2": "assurance",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "consultant",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://splunkpartnerlearningcenter.mindtickle.com/#/programs/program/1442578190349858376"
  },
  {
    "id": 46,
    "title": "Technical Badge - PS Splunk APM - Foundational",
    "description": "",
    "duration": null,
    "cost": null,
    "type": "accreditation",
    "product1": "apm",
    "product2": "",
    "product3": "",
    "product4": "",
    "product5": "",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "sre",
    "persona3": "devops",
    "link": "https://splunkpartnerlearningcenter.mindtickle.com/#/programs/program/1431360366701515702"
  },
  {
    "id": 47,
    "title": "Technical - DevOps | Observability",
    "description": "",
    "duration": null,
    "cost": null,
    "type": "accreditation",
    "product1": "im",
    "product2": "apm",
    "product3": "log",
    "product4": "rum",
    "product5": "synth",
    "level": 301,
    "phase1": "",
    "phase2": "",
    "phase3": "optimization",
    "phase4": "modernization",
    "persona1": "",
    "persona2": "",
    "persona3": "devops",
    "link": "https://splunkpartnerlearningcenter.mindtickle.com/#/programs/program/1355243199843981743"
  }
 ]